In [1]:
%run helper/setup_notebook.ipynb import display_table

Successfully connected to leetcode50 database.

In [2]:
display_table('Employee')

+----+--------+
| id | salary |
+----+--------+
| 1  |  100   |
| 2  |  200   |
| 3  |  300   |
+----+--------+

### Find the second highest salary from the Employee table. If there is no second highest salary, return null.

```
+---------------------+
| SecondHighestSalary |
+---------------------+
| 200                 |
+---------------------+
```

In [3]:
%%sql 
-- Fails the test case
SELECT 
    IFNULL(salary, null) AS SecondHighestSalary
FROM Employee 
ORDER BY salary DESC 
LIMIT 1 OFFSET 1;

[(200,)]

The `IFNULL()` takes two arguments: the first argument is the value to be checked, and the second argument is the value to be returned if the first argument is NULL.

```sql
IFNULL(expression, value)
```

- `expression`: This is the value or column you want to check for NULL.
- `value`: This is the value to be returned if the expression is NULL.

The `IFNULL()` function evaluates the expression. If the expression is not NULL, it returns the value of the expression as is. However, if the expression is NULL, it returns the specified value instead.

In [4]:
%%sql 

SELECT 
    IFNULL(null, (
        SELECT 
            salary 
        FROM Employee 
        ORDER BY salary DESC 
        LIMIT 1 OFFSET 1)
    ) AS SecondHighestSalary

[(200,)]

# Using Pandas

In [5]:
employee_query = %sql SELECT * FROM Employee # type: ignore
employee_df = employee_query.DataFrame()

display(employee_df)

   id  salary
0   1     100
1   2     200
2   3     300

In [8]:
employee_df.sort_values('salary', ascending=False)

   id  salary
2   3     300
1   2     200
0   1     100

In [10]:
employee_df.sort_values('salary', ascending=False).loc[1]

id          2
salary    200
Name: 1, dtype: int64

In [16]:
employee_df.sort_values('salary', ascending=False).loc[1:1]

   id  salary
1   2     200

In [17]:
employee_df.sort_values('salary', ascending=False).loc[1:1][['salary']]

   salary
1     200

In [18]:
employee_df.sort_values('salary', ascending=False) \
    .loc[1:1][['salary']] \
    .rename(columns={'salary': 'SecondHighestSalary'})

   SecondHighestSalary
1                  200